[
  {
    "title": "FOOLPROOF SOFT-BOILED EGGS",
    "ingredients": "[\"1 quart water for every 2 eggs\",\"1 to 12 large eggs\"]",
    "instructions": "[\"Choose a lidded saucepan (or pot) small enough that the eggs will be fully submerged when you add them to the water. Bring the water to a boil over high heat. Add the eggs, cover the pan, and remove from the heat. Cook the eggs according to the times given in the chart, then remove with a slotted spoon and serve immediately.\"]"
  },
  {
    "title": "FOOLPROOF HARD-BOILED EGGS",
    "ingredients": "[\"2 quarts water\",\"1 to 6 large eggs\",\"12 ice cubes\"]",
    "instructions": "[\"Pour the water into a lidded 3-quart saucepan and bring to a boil over high heat. Carefully lower the egg(s) into the water and cook for 30 seconds. Add the ice cubes and allow the water to return to a boil, then reduce to a subsimmer, about 190°F. Cook for 11 minutes. Drain the egg(s) and peel under cool running water.\"]"
  },
  {
    "title": "PERFECT POACHED EGGS",
    "ingredients": "[\"3 quarts water\",\"2 tablespoons kosher salt\",\"Large eggs (as many as desired)\"]",
    "instructions": "[\"For many aspiring French chefs, great hollandaise is the bane of their existence. Far removed from the gloppy, greasy stuff you get at the typical diner, or worse, the powdered “just add milk” cafeteria version, a true hollandaise is creamy and rich, impossibly smooth, and perfectly well balanced with the flavors of eggs, butter, and a touch of lemon juice. It should flow slowly off a spoon so that it naps a poached egg in a thick robe. Never runny, and certainly never curdled, hollandaise has a delicate texture that’s really tough to get right. At least, it used to be. I’ve figured out a way to make it perfectly every single time—even with no experience.\",\"1.  Combine the water and salt in a large saucepan and bring to a boil over high heat, then reduce the heat to the lowest setting.\",\"2.  Carefully break the eggs into individual small bowls or cups. Carefully tip one egg into a fine-mesh strainer set over a bowl and allow the excess white to drain, swirling the strainer gently. You should be left with the yolk surrounded by tight egg white. Gently lower the strainer into the water, then tilt the egg out into the water. Repeat with the remaining eggs.\",\"3.  Allow the eggs to cook, swirling the water occasionally to keep them moving lazily around the pan and gently turning them, until the whites are fully set but the yolks are still runny, about 4 minutes.\",\"4.  To serve immediately, pick up the eggs one at a time with a perforated spoon and transfer to a paper-towel-lined plate to drain briefly. Serve.\",\"5.  Or, to save the eggs for later, pick up the eggs one at a time with a perforated spoon and transfer to a bowl of cold water to chill, then store submerged in the water in the refrigerator for up to 3 days. To reheat, transfer to a bowl of hot water and allow to stand until warm, about 15 minutes.\"]"
  },
  {
    "title": "FOOLPROOF HOLLANDAISE SAUCE",
    "serves": "MAKES ABOUT 1 CUP",
    "ingredients": "[\"3 large egg yolks\",\"1 tablespoon lemon juice (from 1 lemon)\",\"1 tablespoon hot water\",\"½ pound (2 sticks) unsalted butter, cut into rough tablespoon-sized chunks\",\"Pinch of cayenne pepper\",\"Kosher salt\"]",
    "instructions": "[\"TO MAKE HOLLANDAISE WITH AN IMMERSION BLENDER\",\"TO MAKE HOLLANDAISE IN A STANDARD BLENDER OR FOOD PROCESSOR\",\"1.  Add the egg yolks, lemon juice, and hot water to the blender cup (or a cup that will just barely hold the head of your blender).\",\"2.  Melt the butter in a small saucepan over medium-low heat and continue to heat until the butter just begins to bubble and registers 180° to 190°F on an instant-read thermometer. Transfer it to a liquid measuring cup, leaving the thin layer of whitish liquid behind (discard it).\",\"3.  Insert the head of blender into the bottom of the cup and run the blender. Slowly pour in the hot butter. You should see the sauce begin to form at the bottom of the cup. As the sauce forms, slowly pull the head of the blender up to incorporate more melted butter, until all of the butter is incorporated and the sauce has the consistency of heavy cream. Season with the cayenne and salt to taste. Transfer to a serving bowl or small saucepan, cover, and keep in a warm spot (not directly over heat!) until ready to serve.\",\"1.  Add the egg yolks, lemon juice, and hot water to the blender or food processor and blend on medium speed until smooth, about 10 seconds.\",\"2.  Melt the butter in a small saucepan over medium-low heat and continue to heat until the butter just begins to bubble and registers 180° to 190°F on an instant-read thermometer.\",\"3.  With the blender running on medium speed, slowly drizzle in the butter over the course of 1 minute, stopping to scrape down the sides as necessary and leaving the thin layer of whitish liquid in the bottom of the pan (discard it). The sauce should be smooth, with the consistency of heavy cream. Season with the cayenne and salt to taste. Transfer to a serving bowl or small saucepan, cover, and keep in a warm spot (not directly over heat!) until ready to serve.\"]"
  },
  {
    "title": "EGGS BENEDICT",
    "serves": "SERVES 2 TO 4",
    "ingredients": "[\"2 tablespoons kosher salt\",\"2 teaspoons vegetable oil\",\"4 slices Canadian bacon or thick-cut ham\",\"4 large eggs\",\"2 English muffins, split, toasted, and buttered\",\"1 recipe Foolproof Hollandaise (here), kept warm\",\"Dash of cayenne pepper (optional)\",\"Minced fresh parsley or chives (optional)\"]",
    "instructions": "[\"1.  Combine 3 quarts water and the salt in a large saucepan and bring to a boil over high heat.\",\"2.  While the water is heating, heat the vegetable oil in a 12-inch stainless steel or cast-iron skillet over medium heat until shimmering. Add the Canadian bacon (or ham) and cook, turning once, until browned on both sides, about 5 minutes. Transfer to a large plate and tent with foil to keep warm.\",\"3.  Carefully break the eggs into individual small bowls or cups. Turn off the heat under the boiling water. Carefully tip one egg into a fine-mesh strainer set over a bowl and allow the excess white to drain. You should be left with the yolk surrounded by tight egg white. Gently lower the strainer into the water, then tilt the egg out into the water. Repeat with the remaining eggs.\",\"4.  Allow the eggs to cook, swirling the water occasionally to keep them moving lazily around the pan and gently turning them, until the whites are fully set but the yolks are still runny, about 4 minutes. Remove the eggs with a slotted spoon and transfer to a paper-towel-lined plate to drain.\",\"5.  Top each English muffin half with a slice of Canadian bacon, followed by a poached egg. Spoon some hollandaise sauce over the eggs, sprinkle with the cayenne pepper and herbs, if using, and serve immediately, passing the extra hollandaise in a warm bowl on the side.\"]"
  },
  {
    "title": "EXTRA-CRISPY SUNNY-SIDE-UP EGGS",
    "serves": "SERVES 1",
    "ingredients": "[\"2 large eggs\",\"3 tablespoons olive oil (extra-virgin, if you prefer)\",\"Kosher salt and freshly ground black pepper\"]",
    "instructions": "[\"1.  Break one egg into a small cup, then transfer to a fine-mesh strainer set over a bowl and swirl gently until any excess white passes through. Return the egg to the cup. Repeat with the second egg.\",\"2.  Heat the olive oil in a medium nonstick or cast-iron skillet over medium heat until it registers 300°F on an instant-read thermometer. Carefully slip the eggs into the oil. Immediately tilt the skillet so that the oil pools on one side and use a spoon to spoon the hot oil over the egg whites, trying to avoid the yolks as much as possible. Continue doing this until the egg whites are completely set and crisp on the bottom, about 1 minute. With a spatula, transfer the eggs to a paper-towel-lined plate and season with salt and pepper. Serve immediately.\"]"
  },
  {
    "title": "LIGHT AND FLUFFY SCRAMBLED EGGS",
    "serves": "SERVES 4",
    "ingredients": "[\"8 large eggs\",\"¾ teaspoon kosher salt\",\"3 tablespoons whole milk\",\"2 tablespoons unsalted butter\"]",
    "instructions": "[\"1.  Combine the eggs, salt, and milk in a medium bowl and whisk until homogeneous and frothy, about 1 minute. Allow to rest at room temperature for at least 15 minutes. The eggs should darken in color significantly.\",\"2.  Melt the butter in a 10-inch nonstick skillet over medium-high heat, swirling the pan as it melts to coat evenly. Rewhisk the eggs until they are foamy, then transfer to the skillet and cook, slowly scraping the bottom and sides of the pan with a silicone spatula as the eggs solidify. Then continue to cook, scraping and folding constantly, until the eggs have formed solid, moist curds and no liquid egg remains, about 2 minutes (the eggs should still appear slightly underdone). Immediately transfer to a plate and serve.\"]"
  },
  {
    "title": "CREAMY SCRAMBLED EGGS",
    "serves": "SERVES 4",
    "ingredients": "[\"6 large eggs\",\"2 large egg yolks\",\"¾ teaspoon kosher salt\",\"2 tablespoon unsalted butter, cut into ¼-inch cubes and chilled\",\"2 tablespoons heavy cream or crème fraîche (see here)\"]",
    "instructions": "[\"1.  Combine the eggs, egg yolks, and salt in a medium bowl and whisk until homogeneous and frothy, about 1 minute. Allow to rest at room temperature for at least 15 minutes. The eggs should darken in color significantly.\",\"2.  Add the chilled butter to the eggs, then transfer the mixture to a 10-inch nonstick skillet, place over medium-low heat, and cook, stirring constantly, until the butter completely melts and the eggs begin to set. As the eggs become firmer, stir more rapidly to break up the large curds, and continue to cook until no liquid egg remains.\",\"3.  Remove the pan from heat, add the heavy cream, and, stir constantly for 15 seconds; the eggs should be completely tender with a custard-like texture that just barely holds a shape when you pile them up. Transfer to a plate and serve immediately.\"]"
  },
  {
    "title": "EASY HOMEMADE CRÈME FRAÎCHE",
    "serves": "MAKES 2 CUPS",
    "ingredients": "[\"2 cups heavy cream\",\"2 tablespoons buttermilk\"]",
    "instructions": "[\"Combine the heavy cream and buttermilk in a glass jar or bowl. Cover and allow to rest at room temperature until thickened to the desired texture, 6 to 12 hours. Store in the refrigerator in a sealed container for up to 2 weeks.\"]"
  },
  {
    "title": "DINER-STYLE HAM AND CHEESE OMELET",
    "serves": "MAKES 1 LARGE OMELET, SERVING 2",
    "ingredients": "[\"5 large eggs\",\"¾ teaspoon kosher salt\",\"¼ teaspoon freshly ground black pepper\",\"2 tablespoons unsalted butter\",\"4 ounces ham steak, diced\",\"2 ounces cheddar cheese, grated\"]",
    "instructions": "[\"1.  Combine the eggs, salt, and pepper in a medium bowl and whisk until homogeneous and frothy, about 1 minute. Allow to rest at room temperature for at least 15 minutes. The eggs should darken in color significantly.\",\"2.  Meanwhile, melt 1 tablespoon of the butter in a 10-inch nonstick skillet over medium heat and cook until lightly browned. Add the ham and cook, stirring frequently, until it has begun to brown on the edges, about 3 minutes. Transfer the ham to a small bowl, add the cheese, and toss to combine. Wipe out the skillet with a paper towel and return it to medium heat.\",\"3.  Add the remaining tablespoon of butter to the pan and cook until lightly browned. Rewhisk the eggs until foamy, then add to the skillet and cook, using a silicone spatula to push the edges in toward the center as they set and tilting the pan to spread the uncooked egg underneath. Continue pushing in the edges of the eggs and tilting the skillet, working all around the pan, until the omelet is almost set, about 45 seconds. Sprinkle the ham and cheese over half of the omelet, remove from the heat, cover, and let the omelet sit until it reaches the desired consistency, about 1 minute.\",\"4.  Using the silicone spatula, loosen the edges of the omelet from the skillet and shake the skillet to ensure that it’s not stuck. Carefully fold the omelet in half, then slide it onto a serving plate and serve immediately.\",\"1.  Omit the ham. Melt 1 tablespoon of the butter in a 10-inch nonstick skillet over medium-high heat and cook until lightly browned. Add ½ cup sliced mushrooms, season with salt and pepper, and cook, stirring and tossing frequently, until they’ve released liquid, the liquid has evaporated, and the mushrooms have started to sizzle again, about 3 minutes. Add ½ cup diced bell pepper and ½ cup diced onion, season with salt and pepper, and cook, stirring and tossing frequently, until the vegetables are softened and lightly browned, about 5 minutes longer. Transfer to a small bowl, add the cheese, and toss to combine.\",\"2.  Wipe out the skillet with a paper towel, return it to medium heat, and cook the omelet as directed. When the omelet is almost set, sprinkle the vegetables over half of it and proceed as directed.\",\"1.  Omit the ham and cheddar cheese. Melt 1 tablespoon of the butter in a 10-inch nonstick skillet over medium-high heat and cook until lightly browned. Add 8 stalks asparagus, bottoms trimmed and cut into 1-inch segments, season with salt and pepper, and cook, stirring and tossing frequently, until tender and beginning to brown, about 5 minutes. Add 1 large shallot, thinly sliced (about ½ cup) and cook until softened, about 3 minutes. Transfer the vegetables to a small bowl.\",\"2.  Wipe out the skillet with a paper towel, return it to medium heat, and cook the omelet as directed. When the omelet is almost set, scatter the asparagus, shallots, and 2 to 3 ounces fresh goat cheese, crumbled, over half of it and proceed as directed.\"]"
  },
  {
    "title": "TENDER FANCY-PANTS OMELET",
    "serves": "SERVES 1",
    "ingredients": "[\"3 large eggs\",\"1 large egg yolk\",\"½ teaspoon kosher salt\",\"¼ teaspoon freshly ground black pepper\",\"1 tablespoon whole milk\",\"1 tablespoon chopped mixed fresh herbs, such as parsley, tarragon, and chives (optional)\",\"1½ tablespoons unsalted butter, cut into ¼-inch cubes and chilled\"]",
    "instructions": "[\"1.  Combine the eggs, egg yolk, salt, pepper, milk, and herbs, if using, in a medium bowl and whisk until homogeneous and frothy, about 1 minute. Allow to rest at room temperature for at least 15 minutes. The eggs should darken in color significantly.\",\"2.  Add two-thirds of the butter to the eggs. Melt the remaining butter in an 8-inch nonstick skillet over low heat. Add the egg mixture to the skillet and cook, stirring slowly and constantly with a silicone spatula, scraping the eggs off the bottom and sides of the skillet, until the eggs have begun to set, about 2 minutes. Then continue cooking, stirring and scraping, until the eggs are just firm enough to hold their shape when you draw the spatula through them. Shake the pan to distribute the eggs evenly over the bottom and then, holding the handle so that the pan rests at a slight angle, rap the pan against the stove so that the eggs are thicker on one side of the pan than the other. Remove from the heat, cover, and let the eggs set to the desired consistency, about 1 minute.\",\"3.  Remove the lid and, using the spatula, carefully roll the omelet, starting from the thicker side, then tuck the ends under. Carefully turn the omelet out onto a plate (it helps to hold the plate in one hand and the pan in the other), readjust the shape, and serve immediately.\"]"
  },
  {
    "title": "CRISPY FRIED BACON",
    "serves": "SERVES 2 TO 4",
    "ingredients": "[\"8 slices bacon, cut crosswise in half\"]",
    "instructions": "[\"1.  Place the bacon in an even layer in a 12-inch cast-iron or heavy-bottomed nonstick skillet and cook over medium heat until sizzling, about 4 minutes. Reduce the heat to medium-low and continue to cook until the fat is rendered and the bacon is crisp on both sides, flipping and rearranging the slices as necessary, about 12 minutes total.\",\"2.  Drain the bacon on a paper-towel-lined plate and serve.\"]"
  },
  {
    "title": "CRISPY OVEN-FRIED BACON",
    "serves": "SERVES 6 TO 10",
    "ingredients": "[\"24 slices bacon (about 1 pound)\"]",
    "instructions": "[\"1.  Adjust the oven racks to the lower- and upper-middle positions and preheat the oven to 425°F. Arrange the bacon slices in a single layer on two rimmed baking sheets. Roast the bacon until it’s crisp and brown, 18 to 20 minutes, rotating the pans back to front and top to bottom halfway through cooking.\",\"2.  Drain the bacon on a paper-towel-lined plate and serve.\"]"
  },
  {
    "title": "BASIC CRISPY POTATO CAKE",
    "serves": "SERVES 2 OR 3",
    "ingredients": "[\"3 medium russet (baking) potatoes (about 1 pound), rinsed and cut into 1⁄16-inch matchsticks or grated on the large holes of a box grater\",\"¼ cup olive oil\",\"Kosher salt and freshly ground black pepper\"]",
    "instructions": "[\"1.  Spread the potatoes on a large microwave-safe plate and microwave on high until hot all the way through and softened but still slightly crunchy, about 5 minutes.\",\"2.  Heat 2 tablespoons of the oil in skillet over medium heat until shimmering. Add the potatoes and press into the bottom of the pan with a rubber spatula. Season with salt and pepper. Cook, swirling and shaking the pan occasionally, until the potatoes are deep golden brown and crisp on the first side, about 7 minutes. Carefully slide the rösti onto a large plate. Set another plate on top of it, upside down, grip the edges, and invert the whole thing so the rösti is now cooked side up.\",\"3.  Heat the remaining 2 tablespoons oil in the skillet and slide the rösti back in. Season with salt and pepper. Continue cooking, swirling and shaking the pan occasionally, until the rösti is deep golden brown and crisp on the second side, about 7 minutes longer. Slide onto a cutting board and serve immediately, with aioli or mayonnaise, or ketchup.\"]"
  },
  {
    "title": "CRISPY POTATO, ONION, AND MUSHROOM CAKE",
    "serves": "SERVES 2 OR 3",
    "ingredients": "[\"3 medium russet (baking) potatoes (about 1 pound), rinsed and cut into 1⁄16-inch matchsticks or grated on the large holes of a box grater\",\"5 tablespoons olive oil\",\"1 medium onion, finely sliced (about 1 cup)\",\"4 ounces button mushrooms, finely sliced\",\"2 medium garlic cloves, minced or grated on a Microplane (about 2 teaspoons)\",\"1 teaspoon fresh thyme leaves\",\"Kosher salt and freshly ground black pepper\"]",
    "instructions": "[\"1.  Spread the potatoes on a large microwave-safe plate and microwave on high until hot all the way through and softened but still slightly crunchy, about 5 minutes.\",\"2.  Meanwhile, heat 1 tablespoon of the oil in a 10-inch cast-iron or heavy-bottomed nonstick skillet over medium-high heat until shimmering. Add the onions and mushrooms and cook, stirring and tossing occasionally, until softened and starting to brown, about 8 minutes. Add the garlic and thyme and cook, stirring frequently, until fragrant, about 30 seconds. Season to taste with salt and pepper. Transfer to a small bowl and wipe out the skillet.\",\"3.  Heat 2 tablespoons oil in the skillet over medium heat until shimmering. Add half of the potatoes and press into the bottom of the pan with a rubber spatula. Season with salt and pepper. Spread the onion/mushroom mixture evenly over the potatoes and top with the remaining potatoes. Press down into an even disk, using the spatula. Season with salt and pepper. Cook, swirling and shaking the pan occasionally, until the potatoes are deep golden brown and crisp on the first side, about 7 minutes. Carefully slide the rösti onto a large plate. Set another plate on top of it, upside down, grip the edges, and invert the whole thing so the rösti is now cooked side up.\",\"4.  Heat the remaining 2 tablespoons oil in the skillet and slide the rösti back in. Season with salt and pepper. Continue cooking, swirling and shaking the pan occasionally, until the rösti is deep golden brown and crisp on the second side, about 7 minutes longer. Slide the rösti into a cutting board. Serve immediately, with aioli or mayonnaise, or ketchup.\"]"
  },
  {
    "title": "POTATO HASH",
    "serves": "SERVES 4",
    "ingredients": "[\"1½ pounds russet (baking) potatoes (about 4 medium), peeled and cut into ½-inch cubes\",\"3 tablespoons vegetable oil\",\"1 small red bell pepper, thinly sliced\",\"1 small green bell pepper, thinly sliced\",\"1 small onion, thinly sliced\",\"1 teaspoon Frank’s RedHot or other hot sauce, or more to taste\",\"Kosher salt and freshly ground black pepper\",\"4 large eggs (optional)\"]",
    "instructions": "[\"Replace the peppers and onions with 8 ounces leftover corned beef, shredded into bite-sized nuggets.\",\"1.  If using the eggs, adjust an oven rack to the upper-middle position and preheat the oven to 400°F. Spread the potatoes on a large microwave-safe plate, cover with paper towels, and microwave on high until heated through but still slightly undercooked, 4 to 6 minutes.\",\"2.  Heat 2 tablespoons of the oil in a 12-inch cast-iron or nonstick skillet (or two 10-inch skillets) over high heat until lightly smoking. Add the potatoes and cook, stirring and tossing them occasionally, until well browned on about half the surfaces, about 5 minutes. Reduce the heat if the pan is smoking heavily.\",\"3.  Add the peppers and onions and cook, tossing and stirring occasionally, until all the vegetables are browned and charred in spots, about 4 minutes longer. Add the hot sauce and cook, stirring constantly, for 30 seconds. Season to taste with salt and pepper. If not using eggs, serve immediately.\",\"4.  If using eggs, make 4 wells in the potatoes and crack the eggs into them. Season the eggs with salt and pepper, then transfer the skillet to the oven. Cook until the whites are just set, about 3 minutes. Serve immediately.\"]"
  },
  {
    "title": "BUTTERMILK PANCAKES",
    "ingredients": "[]",
    "instructions": "[\"Apart from its starch content, bread is basically just a ball of protein filled with gas (very much like my dog, in that respect)†. When flour is mixed with liquid, two proteins naturally present in wheat, glutenin and gliadin, link together to form the resilient, stretchy protein matrix known as gluten. In leavened breads, air bubbles are formed in this matrix and expand, creating the familiar hole structure inside a loaf of bread (or a good pizza crust, for that matter).\",\"The most interesting side effect of using baking soda in a recipe is that it affects browning in a major way. The Maillard reaction, named after Louise Camille Maillard, who first described its processes in the early twentieth century, is the set of reactions responsible for that beautiful brown crust on your steak and the deep color of a good loaf of bread. Aside from cosmetics, the reaction also produces hundreds of aromatic compounds that add an inimitable savoriness and complexity to foods.\",\"If there’s one major drawback with chemically leavened breads, it’s that they need to be cooked pretty much immediately after the batter is mixed. Unlike a yeasted bread dough, which is low in moisture and kneaded until a tough, elastic gluten network forms to trap the massive amounts of carbon dioxide produced, a quick bread must be made with an extremely moist batter—baking powder simply doesn’t produce enough gas to effectively leaven a thicker dough. Batters have relatively little gluten formation, meaning that they aren’t all that great at trapping and holding bubbles. Once you mix a batter, your baking soda or baking powder immediately begins producing gas, and that gas almost immediately being trying to escape into the air. When working with quick breads, those who aren’t into the whole brevity thing may run into difficulties.\",\"So what if baking soda just isn’t doing enough for you? How do you get your pancakes to stand even taller and lighter? I like to use a meringue—egg whites that have been whipped vigorously until they form a semisolid foam. Here’s how it works:\",\"As far as flavoring buttermilk pancakes go, there are a few givens: Dairy fat, in the form of melted butter or milk, is essential. Not only does it add richness and flavor to the mix, but by coating the flour and limiting gluten development, it also ensures that your pancakes remain tender. Eggs help set the pancakes as they cook, as well as providing some extra lift. Buttermilk is obviously part of the equation, but I like my pancakes extra-tangy, and straight-up buttermilk just doesn’t cut it for me. Increasing the quantity doesn’t work—that just ends up throwing the liquid-to-solid ratio out of whack. Instead, I replace part of the buttermilk with a good amount of sour cream. It’s both less moist than buttermilk and more sour, which allows me to add acidity without watering down the batter. If you don’t have sour cream on hand, don’t worry—the pancakes will still taste just fine with straight-up buttermilk.\"]"
  },
  {
    "title": "BASIC DRY PANCAKE MIX",
    "serves": "MAKES ABOUT 2 CUPS, ENOUGH FOR APPROXIMATELY 16 PANCAKES",
    "ingredients": "[\"10 ounces (2 cups) all-purpose flour\",\"1 teaspoon baking powder\",\"½ teaspoon baking soda\",\"1 teaspoon kosher salt\",\"1 tablespoon sugar\"]",
    "instructions": "[\"Combine all the ingredients in a medium bowl and whisk until homogeneous. Transfer to an airtight container. The mix will stay good for 3 months.\"]"
  },
  {
    "title": "LIGHT AND FLUFFY BUTTERMILK PANCAKES",
    "serves": "MAKES 16 PANCAKES, SERVING 4 TO 6",
    "ingredients": "[\"1 recipe Basic Dry Pancake Mix (above)\",\"2 large eggs, separated\",\"1½ cups buttermilk\",\"1 cup sour cream (see Note above)\",\"4 tablespoons unsalted butter, melted\",\"Butter or oil for cooking\",\"Warm maple syrup and butter\"]",
    "instructions": "[\"Sprinkle 1 to 2 tablespoons thawed frozen blueberries on top of each pancake as soon as you ladle them onto the griddle and proceed as directed.\",\"1.  Place the dry mix in a large bowl.\",\"2.  In a medium clean bowl, whisk the egg whites until stiff peaks form. In a large bowl, whisk the egg yolks, buttermilk, and sour cream until homogeneous. Slowly drizzle in the melted butter while whisking. Carefully fold in the egg whites with a rubber spatula until just combined. Pour the mixture over the dry mix and fold until just combined (there should still be plenty of lumps).\",\"3.  Heat a large heavy-bottomed nonstick skillet over medium heat for 5 minutes (or use an electric griddle). Add a small amount of butter or oil to the griddle and spread with a paper towel until no visible butter or oil remains. Use a ¼-cup dry measure to place 4 pancakes in the skillet and cook until bubbles start to appear on top and the bottoms are golden brown, about 2 minutes. Carefully flip the pancakes and cook on the second side until golden brown and completely set, about 2 minutes longer. Serve the pancakes immediately, or keep warm on a wire rack set on a rimmed baking sheet in a warm oven while you cook the remaining 3 batches. Serve with warm maple syrup and butter.\"]"
  },
  {
    "title": "FRESH RICOTTA",
    "serves": "MAKES ABOUT 1 CUP",
    "ingredients": "[\"4 cups whole milk\",\"½ teaspoon table salt\",\"¼ cup distilled white vinegar or lemon juice (from 2 lemons)\"]",
    "instructions": "[\"You can make this recipe on the stovetop instead of the microwave. Heat the milk and vinegar mixture in a saucepan over medium-low heat, stirring constantly with a silicone spatula to prevent sticking or scorching until it reaches 165°F on an instant-read thermometer. Remove it from the heat and allow to rest until solid white curds form on the surface, about 2 minutes.\",\"1.  Line a colander with four layers of cheesecloth or two layers of food-safe paper towels and set over a large bowl. Combine the milk, salt, and vinegar in a microwave-safe 2-quart liquid measure and microwave on high until lightly bubbling around the edges, 4 to 6 minutes; the milk should register about 165°F on an instant-read thermometer. Remove from the microwave and stir gently for 5 seconds. The milk should separate into solid white curds and translucent liquid whey. If not, microwave for 30 seconds longer and stir again. If necessary repeat until fully separated.\",\"2.  Using a slotted spoon or wire skimmer, transfer the curds to the prepared colander. Cover the exposed top with plastic wrap and allow to drain until the desired texture is reached. Leftover ricotta can be stored in a covered container in the refrigerator for up to 5 days.\"]"
  },
  {
    "title": "WARM RICOTTA",
    "serves": "SERVES 4",
    "ingredients": "[\"1 cup Fresh Ricotta (above), just made\",\"2 tablespoons extra-virgin olive oil, plus more for serving\",\"2 teaspoons grated lemon zest (from 1 lemon)\",\"Flaky sea salt, like Maldon\",\"Freshly ground black pepper\"]",
    "instructions": "[\"Place the ricotta in a serving bowl, drizzle with the olive oil, and sprinkle with the lemon zest and salt and pepper. Serve immediately with toast, passing extra olive oil.\"]"
  },
  {
    "title": "LEMON RICOTTA PANCAKES",
    "serves": "MAKES 12 PANCAKES, SERVING 3 TO 4",
    "ingredients": "[\"½ cup buttermilk\",\"1 cup Fresh Ricotta (here), drained for 30 minutes\",\"2 tablespoons unsalted butter, melted and slightly cooled\",\"2 large eggs\",\"½ teaspoon vanilla extract\",\"1 cup Basic Dry Pancake Mix (here)\",\"2 teaspoons grated lemon zest (from 1 lemon)\",\"Vegetable oil for cooking\",\"Maple syrup\"]",
    "instructions": "[\"1.  Whisk together the buttermilk, ricotta, melted butter, eggs, and vanilla extract in a medium bowl. Add the pancake mix and lemon zest and whisk until no dry flour remains (the mixture should remain lumpy—be careful not to overmix).\",\"2.  Heat ½ teaspoon oil in a 12-inch heavy-bottomed nonstick skillet over medium-high heat (or use an electric griddle) until it shimmers. Reduce the heat to medium and wipe out the skillet with a paper towel. Use a ¼-cup dry measure to scoop 4 pancakes into the pan and cook on the first side until bubbles start to appear on top and the bottoms are golden brown, 2 to 3 minutes. Flip the pancakes and cook until the second side is golden brown, about 2 minutes longer. Serve the pancakes immediately, or keep warm on a wire rack set on a baking sheet in a warm oven while you cook the remaining batches. Serve with maple syrup.\"]"
  },
  {
    "title": "BASIC QUICK WAFFLES",
    "serves": "MAKES 8 SMALL ROUND WAFFLES, FOUR 4-WELL BELGIAN-STYLE WAFFLES, OR 4 LARGE SQUARE WAFFLES, SERVING 4",
    "ingredients": "[\"1 recipe Basic Dry Pancake Mix (here)\",\"2 large eggs\",\"1½ cups buttermilk\",\"4 tablespoons unsalted butter, melted\",\"1 cup ice-cold club soda\",\"1 teaspoon vanilla extract\",\"Butter or oil for the waffle iron\",\"Maple syrup\"]",
    "instructions": "[\"Replace the vanilla extract with 1 tablespoon orange liqueur, such as Grand Marnier, and add 1 teaspoon grated orange zest to the eggs and buttermilk in step 2.\",\"Replace the vanilla extract with maple extract (or 2 tablespoons maple syrup) and add 6 strips crisp bacon, crumbled, to the batter at the end of step 2.\",\"1.  Preheat an electric waffle iron, on the low-heat setting if you have the option, or a heat a stovetop waffle iron over medium-low heat. Place the dry mix in a large bowl.\",\"2.  In a medium bowl, whisk the egg whites until stiff peaks form. In a clean large bowl, whisk the egg yolks and buttermilk until homogeneous. Slowly drizzle in the butter while whisking. Carefully fold the egg whites into the yolk mixture with a rubber spatula until just combined. Fold in the soda water. Pour the mixture over the dry mix and fold until just combined (there should still be plenty of lumps).\",\"3.  If using a 7-inch round stovetop waffle iron, ladle ½ cup of batter into the iron and cook, flipping it occasionally, until the waffle is golden brown and crisp on both sides, about 8 minutes. If using a Belgian waffle iron, scoop ¼ cup batter into each well, close the iron, and immediately flip it, then continue cooking, turning occasionally, until the waffles are golden brown and crisp on both sides, about 10 minutes. If using an electric waffle iron, preheat and cook according to the manufacturer’s instructions. Transfer to a plate, or keep warm on a rack on a baking sheet in a 200°F oven, and cook the remaining batches.\"]"
  },
  {
    "title": "SUPER-FLAKY BUTTERMILK BISCUITS",
    "serves": "MAKES 8 BISCUITS",
    "ingredients": "[\"½ cup buttermilk\",\"½ cup sour cream\",\"10 ounces (2 cups) unbleached all-purpose flour, plus additional for dusting\",\"1 tablespoon baking powder\",\"¼ teaspoon baking soda\",\"1½ teaspoons kosher salt\",\"8 tablespoons (1 stick) cold unsalted butter, cut into ¼-inch pats\",\"2 tablespoons unsalted butter, melted\"]",
    "instructions": "[\"In step 4, sprinkle 6 ounces grated cheddar cheese and ¼ cup sliced scallions over the 12-inch dough square before folding it the second time, and continue as directed. (See photos here–here.)\",\"In step 4, sprinkle ½ cup crumbled cooked bacon and 2 ounces grated Parmigiano-Reggiano over the 12-inch dough square before folding it the second time, and continue as directed. Dust the biscuits with more grated Parmesan before baking.\",\"Add 2 tablespoons sugar to the dry ingredients in step 2. In step 4, if desired, scatter 1 cup frozen or chopped fresh fruit or berries over the dough before folding it the second time. In step 5, roll the dough into a 12-by-4-inch rectangle, then cut the rectangle into three 4-inch squares and cut each square into 2 triangles. Sprinkle the scones with an additional 2 tablespoons sugar and bake as directed.\",\"1.  Adjust an oven rack to the middle position and preheat the oven to 425°F. Whisk together the buttermilk and sour cream in a small bowl.\",\"2.  In the bowl of a food processor, combine the flour, baking powder, baking soda, and salt and process until blended, about 2 seconds. Scatter the butter evenly over the flour and pulse until the mixture resembles coarse meal and the largest butter pieces are about ¼ inch at their widest. Transfer to a large bowl.\",\"3.  Add the buttermilk mixture to the flour mixture and fold with a rubber spatula until just combined. Transfer the dough to a floured work surface and knead until it just comes together, adding extra flour as necessary.\",\"4.  With a rolling pin, roll the dough into a 12-inch square. Using a bench scraper, fold the right third of the dough over the center, then fold the left third over so you end up with a 12-by-4-inch rectangle. Fold the top third down over the center, then fold the bottom third up so the whole thing is reduced to a 4-inch square. Press the square down and roll it out again into a 12-inch square. Repeat the folding process once more.\",\"5.  Roll the dough again into a 12-inch square. Cut six 4-inch rounds out of the dough with a floured biscuit cutter. Transfer the rounds to a parchment-lined baking sheet, spacing them about 1 inch apart. Form the dough scraps into a ball and knead gently two or three times, until smooth. Roll the dough out until it’s large enough to cut out 2 more 4-inch rounds, and transfer to the baking sheet.\",\"6.  Brush the top of the biscuits with the melted butter and bake until golden brown and well risen, about 15 minutes, rotating the pan halfway through. Allow to cool for 5 minutes and serve.\"]"
  },
  {
    "title": "CREAMY SAUSAGE GRAVY",
    "serves": "MAKES ABOUT 3 CUPS, ENOUGH FOR 8 SERVINGS",
    "ingredients": "[\"1 tablespoon unsalted butter\",\"1 pound Maple-Sage Breakfast Sausage (here) or good-quality bulk sausage\",\"1 small onion, finely chopped (about ⅔ cup)\",\"2 tablespoons all-purpose flour\",\"2 cups whole milk\",\"Kosher salt and freshly ground black pepper\"]",
    "instructions": "[\"1.  Heat the butter in a 10-inch heavy-bottomed nonstick skillet over medium-high heat until foamy. Add the sausage and cook, using a wooden spatula or spoon to break up the meat, until no longer pink, about 6 minutes. Add the onion and cook until softened, about 2 minutes.\",\"2.  Add the flour and cook, stirring constantly, until completely absorbed, about 1 minute. Gradually add half of the milk, whisking constantly, then whisk in the remaining milk and allow to come to a simmer, whisking constantly. Simmer, whisking, until thickened, about 3 minutes. Season to taste with salt and plenty of black pepper.\"]"
  },
  {
    "title": "EASY CREAM BISCUITS",
    "serves": "MAKES 8 BISCUITS",
    "ingredients": "[\"10 ounces (2 cups) all-purpose flour\",\"1 tablespoon baking powder\",\"¾ teaspoon kosher salt\",\"4 tablespoons unsalted butter, melted\",\"1¼ cups heavy cream\"]",
    "instructions": "[\"Add 3 tablespoons sugar to the dry mixture in step 1. Fold in ½ cup currants or raisins if desired.\",\"1.  Adjust an oven rack to the middle position and heat the oven to 425°F. Place the flour, baking powder, and salt in a large bowl and whisk to combine. Add 2 tablespoons of the melted butter and the cream and stir with a wooden spoon until a soft dough comes together.\",\"2.  Turn the dough out onto a floured surface and knead gently until it forms a cohesive ball. With a rolling pin, roll it into an approximate 8-inch square, ¾ inch thick. Use a 3-inch round biscuit cutter to cut out biscuits and place on a parchment-lined baking sheet, spacing them 1 inch apart. Gather up the scraps, reroll, and cut out more biscuits (you should end up with 8).\",\"3.  Brush the top of the biscuits with the remaining 2 tablespoons melted butter. Bake until the biscuits are golden brown and well risen, about 15 minutes, rotating the pan halfway through. Allow to cool for 5 minutes, and serve.\"]"
  },
  {
    "title": "THE WORLD’S MOST AWESOME STICKY BUNS",
    "ingredients": "[\"3 large eggs\",\"⅓ cup packed light brown sugar\",\"¾ cup buttermilk\",\"2 teaspoons kosher or 1 teaspoon table salt\",\"2 teaspoons instant yeast\",\"6 tablespoons unsalted butter, melted\",\"20 ounces (4 cups) all-purpose flour, plus more for dusting\",\"4 tablespoons unsalted butter\",\"⅔ cup packed light brown sugar\",\"3 tablespoons buttermilk\",\"4 ounces (about 1 cup) toasted pecans coarsely chopped\",\"Pinch of kosher salt\",\"⅔ cup packed light brown sugar\",\"1 tablespoon ground cinnamon\",\"2 tablespoons unsalted butter, melted\",\"4 ounces cream cheese\",\"¼ cup buttermilk\",\"1½ cups confectioners’ sugar\",\"1 tablespoon grated orange zest (from 1 orange)\",\"2 tablespoons fresh orange juice\",\"Pinch of kosher salt\"]",
    "instructions": "[\"1.  Make the dough: Whisk the eggs in a large bowl until homogeneous. Add the brown sugar, buttermilk, salt, yeast, and melted butter and whisk until homogeneous (the mixture may clump up a bit—this is OK). Add the flour and stir with a wooden spoon until a cohesive ball of dough forms.\",\"2.  Turn the dough out onto a lightly floured surface and knead for 2 minutes, or until completely homogeneous, smooth, and silky. Return to the bowl, cover with plastic wrap, and allow to rise at room temperature until roughly doubled in volume, about 2 hours.\",\"3.  Make the pecan-caramel sauce: Cook the butter and brown sugar in a small saucepan over medium-high heat, stirring occasionally, until the sugar is completely dissolved and the mixture is bubbling, about 2 minutes. Add the buttermilk, pecans, and salt and stir to combine, then pour the mixture evenly over the bottom of a 13-by-9-inch glass baking dish.\",\"4.  Make the filling: Combine the sugar and cinnamon in a small bowl and set aside.\",\"5.  Roll out the dough: Turn the dough out onto a floured surface and lightly flour it. Shape into a rough rectangle with your hands and then, using a rolling pin, roll into a rectangle about 16 inches long and 12 inches wide, with a short end toward you. Brush with the melted butter, leaving a 1-inch border along the top edge. Sprinkle with the cinnamon and sugar mixture and spread it with your hands until the buttered portion is evenly coated. Roll the dough up jelly-roll-style into a tight cylinder, using a bench scraper as necessary to assist you. Pinch the seam shut and turn the dough so that it’s seam side down. Use your hands to even out its shape.\",\"6.  Use a sharp knife to cut the roll into 12 even slices: The easiest way to do this is to cut it in half, cut each half in half, and then cut each section into thirds. Nestle the 12 rolls with the swirl pattern facing up in the prepared baking dish, making sure the slices from the ends of the log go cut side down. Cover with plastic wrap and allow to rise until roughly doubled in volume, about 2 hours (for overnight instructions, see Note above). The rolls should be well puffed and pressed tightly against each other.\",\"7.  While the dough is rising, adjust an oven rack to the middle position and preheat the oven to 350°F. Transfer the baking dish to the oven and bake until the buns are golden brown and well puffed, about 30 minutes, rotating the dish once. Allow to rest for 5 minutes, then invert the buns onto a serving platter; scrape out any excess goo from the pan and spoon over the buns.\",\"8.  Make the (optional) glaze: Combine the cream cheese, buttermilk, confectioners’ sugar, orange zest, orange juice, and salt in a small saucepan and cook over medium heat, whisking constantly, until simmering and homogeneous. Spoon half the glaze over the sticky buns, reserving the rest in a bowl to pass tableside. Serve immediately.\"]"
  },
  {
    "title": "HOMEMADE HOT CHOCOLATE MIX",
    "ingredients": "[\"Two 4-ounce bars 100%-cacao baking chocolate\",\"1 cup Dutch-process cocoa powder\",\"1 cup sugar\",\"2 tablespoons cornstarch\",\"½ teaspoon kosher salt\"]",
    "instructions": "[\"________________\",\"1.  Freeze the chocolate bars until completely frozen, about 10 minutes. Remove from the freezer, break into rough pieces, and place in the food processor, along with the cocoa powder, sugar, cornstarch, and salt. Process until completely powdered, about 1 minute. Transfer to an airtight container and store in cool, dark place for up to 3 months.\",\"2.  To make hot chocolate, add 1 to 2 tablespoons of the mixture, or more if desired, to 1 cup boiling milk and stir or whisk until combined. To thicken it further, return the pan to the heat and simmer for 30 seconds, until thick and smooth.\"]"
  }
]